configuration/src/Catalogs/ОписанияИзмененийСистемы/ОписанияИзмененийСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписанияИзмененийСистемы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Текст дайджеста в формате HTML</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеMarkdown</name>
    <comment>Текст дайджеста в формате Markdown</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>Признак того, что описание стало неактуальным и его не нужно больше отображать пользователю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/ОписаниеИзмененийКЗадачам/ОписаниеИзмененийКЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеИзмененийКЗадачам</name>
  <resources>
    <name>ВидДайджеста</name>
    <type>
      <types>EnumRef.ВидыДайджестов</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <comment>Текст изменений в формате Markdown</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Опубликовано</name>
    <comment>Признак того, что изменение готово к публикации в дайджесте</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзмененийСистемы</name>
    <type>
      <types>CatalogRef.ОписанияИзмененийСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипыИзмененийСистемы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияФайлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидыДайджестов/ВидыДайджестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДайджестов</name>
  <enumValues>
    <name>Внеплановый</name>
    <comment>Описание изменений по задаче нужно опубликовать сразу после обновления базы, не дожидаясь планового дайджеста</comment>
  </enumValues>
  <enumValues>
    <name>Плановый</name>
    <comment>Дайджест будет сформирован вручную по нескольким задачами за период и будет опубликован в указанный день</comment>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/НазначенияФайлов/НазначенияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияФайлов</name>
  <comment>Определяет нахождение файла к области отображения (форматированный документ или список пркрепленных файлов) </comment>
  <enumValues>
    <name>ИзображениеКомментария</name>
    <comment>Файл используется в комментарии (фактически тот же html)</comment>
  </enumValues>
  <enumValues>
    <name>ИзображениеОписанияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияРазработчика</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияТестировщика</name>
  </enumValues>
  <enumValues>
    <name>ОбрезанныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>Объект</name>
    <comment>Прикреплен непосредственно к объекту</comment>
  </enumValues>
  <enumValues>
    <name>ОписаниеИзмененийКЗадаче</name>
  </enumValues>
  <enumValues>
    <name>ПолныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>ФайлыКомментария</name>
  </enumValues>
  <enumValues>
    <name>ФорматированныйДокумент</name>
    <comment>Файл используется в html-документе</comment>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ТипыИзмененийСистемы/ТипыИзмененийСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзмененийСистемы</name>
  <comment>Перечень типов изменений системы для формирования описания</comment>
  <enumValues>
    <name>НовыеВозможности</name>
  </enumValues>
  <enumValues>
    <name>Изменения</name>
  </enumValues>
  <enumValues>
    <name>Исправления</name>
  </enumValues>
  <enumValues>
    <name>Устарело</name>
  </enumValues>
  <enumValues>
    <name>Удалено</name>
  </enumValues>
  <enumValues>
    <name>Безопасность</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.ЗаявкаНаРазработку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомандаРазработчиков</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаStoryPoint</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПубликация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Хранит информацию о прикрепленных файлах</comment>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <comment>Признак неактуальности файла</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеИмя</name>
    <comment>Оригинальное имя файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьИзMinio</name>
    <comment>Временный реквизит для плавного перехода на minio</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла в байтах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/ОписанияИзмененийСистемы/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет необходимость открытия для пользователя окна с описанием изменений
// системы.
//
// Возвращаемое значение:
//  Булево. Истина - необходиимо открыть окно с описанием изменений. В противном 
//  случае Ложь.
//
Функция НеобходимоПоказатьОкноОписанияИзмененийСистемы() Экспорт

	// Нужно проверить, есть ли новые описания.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ПросмотренныеОписанияИзмененийСистемы.ДатаСозданияОписания), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСоздания
	|ПОМЕСТИТЬ ДатаСозданияПоследнегоПросмотренногоОписания
	|ИЗ
	|	РегистрСведений.ПросмотренныеОписанияИзмененийСистемы КАК ПросмотренныеОписанияИзмененийСистемы
	|ГДЕ
	|	ПросмотренныеОписанияИзмененийСистемы.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.ОписанияИзмененийСистемы КАК ОписанияИзмененийСистемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаСозданияПоследнегоПросмотренногоОписания КАК ДатаСозданияПоследнегоПросмотренногоОписания
	|		ПО ОписанияИзмененийСистемы.ДатаСоздания > ДатаСозданияПоследнегоПросмотренногоОписания.ДатаСоздания
	|			И (НЕ ОписанияИзмененийСистемы.ПометкаУдаления)
	|			И (ОписанияИзмененийСистемы.ДатаПубликации <= &ТекущаяДата)";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата",  ТекущаяДатаСеанса());
	
	ПоказатьОписаниеИзменений = НЕ Запрос.Выполнить().Пустой();
	
	Возврат ПоказатьОписаниеИзменений;
	
КонецФункции

// Точка входа для формирования дайджеста изменений.
// Создает новый элемент справочника и собирает дайждест из описаний изменений к задачам
//
Процедура ПодготовитьДайджест() Экспорт
	
	Данные = ПолучитьТекстВнеплановогоДайджеста(Справочники.СистемыУчета.ПолучитьСистемуУчетаSDMS());
	
	Если Данные.Описание <> "" Тогда 
		Добавить(Данные.Описание);
		РегистрыСведений.ОписаниеИзмененийКЗадачам.ОтметитьОпубликованым(Данные.МассивЗадач);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текст дайджеста
//
// Параметры:
//  СистемыУчета - Массив, СписокЗначений	 - массив систем учетов
// 
// Возвращаемое значение:
//  Данные - Структура данных дайджеста
//
Функция ПолучитьТекстВнеплановогоДайджеста(Знач СистемыУчета) Экспорт
	
	Результат = Новый Структура("МассивЗадач, Описание", Новый Массив, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписаниеИзменений.Задача КАК Задача,
	|	ОписаниеИзменений.ДатаДобавления КАК ДатаДобавления,
	|	ОписаниеИзменений.Описание КАК Описание,
	|	ОписаниеИзменений.ТипИзменения КАК ТипИзменения,
	|	ПРЕДСТАВЛЕНИЕ(ОписаниеИзменений.ТипИзменения) КАК ПредставлениеТипаИзменения,
	|	ОписаниеИзменений.ДатаПубликации КАК ДатаПубликации
	|ПОМЕСТИТЬ ОписанияДайджестов
	|ИЗ
	|	РегистрСведений.ОписаниеИзмененийКЗадачам КАК ОписаниеИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Задача КАК ДокументЗадача
	|		ПО ОписаниеИзменений.Задача = ДокументЗадача.Ссылка
	|ГДЕ
	|	НЕ ОписаниеИзменений.Опубликовано
	|	И ОписаниеИзменений.ВидДайджеста = ЗНАЧЕНИЕ(Перечисление.ВидыДайджестов.Внеплановый)
	|	И ДокументЗадача.СистемаУчета В(&СистемаУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.Высота КАК Высота,
	|	Файлы.Ширина КАК Ширина
	|ИЗ
	|	ОписанияДайджестов КАК ОписанияДайджестов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	|		ПО (ОписанияДайджестов.Задача = (ВЫРАЗИТЬ(ПрикрепленныеФайлы.Объект КАК Документ.Задача)))
	|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.ОписаниеИзмененийКЗадаче))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|		ПО (ПрикрепленныеФайлы.Файл = Файлы.Ссылка)
	|ГДЕ
	|	НЕ Файлы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписанияДайджестов.Задача КАК Задача,
	|	ОписанияДайджестов.ДатаДобавления КАК ДатаДобавления,
	|	ОписанияДайджестов.Описание КАК Описание,
	|	ОписанияДайджестов.ТипИзменения КАК ТипИзменения,
	|	ОписанияДайджестов.ПредставлениеТипаИзменения КАК ПредставлениеТипаИзменения
	|ИЗ
	|	ОписанияДайджестов КАК ОписанияДайджестов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.ТипыИзмененийСистемы КАК ТипыИзмененийСистемы
	|		ПО ОписанияДайджестов.ТипИзменения = ТипыИзмененийСистемы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыИзмененийСистемы.Порядок,
	|	ОписанияДайджестов.ДатаПубликации
	|ИТОГИ ПО
	|	ТипИзменения,
	|	Задача";
	
	Запрос.УстановитьПараметр("СистемаУчета", СистемыУчета); 
	Пакеты = Запрос.ВыполнитьПакет();
	ДанныеКартинок = Пакеты.Получить(1).Выгрузить();
	РезультатЗапроса = Пакеты.Получить(2);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЧастиОписания = Новый Массив;
		
		ЗаголовокДайджеста = СтрШаблон("<h1>Изменения системы от %1</h1>", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"));
		ЧастиОписания.Добавить(ЗаголовокДайджеста);
		
		ВыборкаТипИзменения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипИзменения");
		
		Пока ВыборкаТипИзменения.Следующий() Цикл
			ТипИзмененияДайджеста = СтрШаблон("<h2>%1</h2>", ВыборкаТипИзменения.ТипИзменения);
			ЧастиОписания.Добавить(ТипИзмененияДайджеста);
			
			ВыборкаЗадача = ВыборкаТипИзменения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЗадача.Следующий() Цикл
				ВыборкаОписание = ВыборкаЗадача.Выбрать();
				
				Пока ВыборкаОписание.Следующий() Цикл
					ЧастиОписания.Добавить(ВыборкаОписание.Описание.Получить());
					
					ДанныеЗадачи = Новый Структура("Задача, ДатаДобавления");
					ЗаполнитьЗначенияСвойств(ДанныеЗадачи, ВыборкаОписание);
					
					Результат.МассивЗадач.Добавить(ДанныеЗадачи);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Результат.Описание = СтрСоединить(ЧастиОписания, Символы.ПС);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Создать HTMLДайджеста
//
// Параметры:
//  ИсходныйТекст	 - Строка	 - текст дайджеста в Markdown
// 
// Возвращаемое значение:
//  Строка - текст дайджеств в html
//
Функция СоздатьHTMLДайджеста(Знач ИсходныйТекст) Экспорт
	
	Шаблон = 
	"<!doctype html>
	|<html>
	|<head>
	|	<meta charset=""utf-8""/>
	|	<meta http-equiv=""X-UA-Compatible"" content=""IE=9""/>
	|	<link href=""%1/css/redmine.min.css"" rel=""stylesheet"" charset=""utf-8"">
	|	<style>
	|		.incorrect {
	|			border-bottom: 2px solid red
	|		}
	|		.correct {
	|			border-bottom: 2px solid #90EE90
	|		}
	|		.current {
	|			background:#FFA07A
	|		}
	|		.mistakesLink {
	|			text-decoration:none;color:black;
	|		}
	|		.markdown-body {
	|			box-sizing: border-box;
	|			min-width: 200px;
	|			margin: 0 auto;
	|			padding: 45px;
	|		}
	|	</style>
	|</head>
	|<body>
	|	<div id=""content"" class=""markdown-body"">%2</div>
	|</body>
	|</html>";
	
	Возврат СтрШаблон(Шаблон, WebОкружениеВызовСервера.АдресПубликацииСлужебныхДанных(), ИсходныйТекст);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает новый элемент справочника
//
// Параметры:
//  Описание - Строка	 - текст дайджеста в формате HTML
//
Процедура Добавить(Знач Описание)
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.ДатаСоздания = ТекущаяДатаСеанса();
	НовыйЭлемент.ДатаПубликации = ТекущаяДатаСеанса();
	НовыйЭлемент.Описание = Новый ХранилищеЗначения(Описание, Новый СжатиеДанных(9));
	
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти
